app/controllers/articles_controller.rb

INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 15 Oct 2014 15:11:59 UTC +00:00], ["text", "text"], ["title", "test"], ["updated_at", Wed, 15 Oct 2014 15:11:59 UTC +00:00]]
---
  def create
   @article = Article.new(params[:article])

   if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "articles" SET "title" = 'article4', "text" = 'text4', "updated_at" = '2014-10-16 15:04:11.718053' WHERE "articles"."id" = 4
---
  def update
   @article = Article.find(params[:id])
   if @article.update_attributes(params[:article])